# FabricationItemFile Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationItemFile Members
FabricationItemFile Class Methods Properties See Also
---
The FabricationItemFile type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FabricationItemFile |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetImage | Gets the image for the fabrication item file. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsLoaded | Checks to see if the item file has been loaded into the configuration. |
| IsValid | Checks to see if the item file is valid. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Identifier | The string identifier for the item file. This string is unique and can be used to compare whether fabrication item files are the same file. |
| IsUsed | Checks to see if the item file is already in use in the project. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FabricationItemFile Class
Autodesk.Revit.DB Namespace